{
    "navbar": {
      "home": "الرئيسية",
      "about": "حول",
      "projects": "المشاريع",
      "resume": "السيرة الذاتية",
      "certificate": "الشهادات"
    },
    "1st": {
      "greeting": "مرحبًا!",
      "introduction": "أنا",
      "name": "غوري زهير",
      "title": "دعني أعرفك بنفسي",
      "intro": "منذ أن كتبت أول سطر برمجي، اكتشفت شغفي بحل المشكلات والابتكار. مع مرور الوقت، صقلت مهاراتي وما زلت أنمو في مجال هندسة البرمجيات.",
      "skills": "أنا متمرس في تقنيات مثل Python مع Django، وJavaScript مع React.js، وPHP مع Laravel، بالإضافة إلى إتقان أساسيات الواجهة الأمامية مثل HTML وCSS وBootstrap.",
      "interests": "تكمن مجالات اهتمامي في الحوسبة السحابية وDevOps والذكاء الاصطناعي، حيث أطمح إلى بناء حلول تدفع الكفاءة وتفتح إمكانيات جديدة في التكنولوجيا.",
      "projects": "كلما أمكن، أوجه شغفي بالتطوير نحو المشاريع، مستخدمًا أطر العمل والأدوات الحديثة مثل React.js لتحويل الأفكار إلى واقع. أنا مدفوع برغبة في دفع الحدود والتعلم المستمر والمساهمة في مستقبل التكنولوجيا.",
      "hobbies": "خارج نطاق التكنولوجيا، أنا شغوف بالرياضة ومشارك بنشاط في العمل التطوعي، مما يساعدني على النمو شخصيًا مع رد الجميل للمجتمع.",
      "findMe": "تجدني على",
      "connect": "لا تتردد في التواصل معي"
    },
    "common": {
      "introduce": "تعريف",
      "problemSolving": "حل المشكلات",
      "innovation": "الابتكار",
      "pythonDjango": "Python مع Django",
      "javascriptReact": "JavaScript مع React.js",
      "phpLaravel": "PHP مع Laravel",
      "html": "HTML",
      "css": "CSS",
      "bootstrap": "Bootstrap",
      "cloudComputing": "الحوسبة السحابية",
      "devOps": "DevOps",
      "artificialIntelligence": "الذكاء الاصطناعي",
      "modernFrameworks": "أطر العمل الحديثة",
      "reactjs": "React.js",
      "sports": "الرياضة",
      "volunteering": "العمل التطوعي"
    },
    "2nd": {
      "greeting": "مرحبًا بالجميع، أنا",
      "name": "غوري زهير",
      "from": "من",
      "country": "المغرب",
      "education": "أنا حاليًا طالب في السنة الثانية في هندسة البرمجيات في المدرسة المغربية لعلوم الهندسة.",
      "passion": "أنا شغوف باستكشاف تطوير الويب وDevOps والذكاء الاصطناعي، وأبحث دائمًا عن فرص لتطبيق هذه التقنيات المتطورة على مشاكل العالم الحقيقي.",
      "otherActivities": "بجانب البرمجة، هناك بعض الأنشطة التي أستمتع بها:",
      "activities": {
        "volunteering": "التطوع لتطوير مهارات القيادة والعمل الجماعي",
        "hackathons": "المشاركة في الهاكاثونات لصقل قدرات حل المشكلات",
        "learning": "التعلم المستمر من خلال الدورات والشهادات عبر الإنترنت",
        "communication": "ممارسة التواصل والتعاون في مشاريع الفريق"
      },
      "quote": "أسعى دائمًا للابتكار وخلق حلول تحدث تأثيرًا إيجابيًا!",
      "footer": "زهير"
    },
    "3rd": {
      "title": "تعرف على",
      "name": "من أنا",
      "altText": "حول",
      "professionalSkillset": "المهارات",
      "skillset": "المهنية",
      "tools": "الأدوات",
      "iUse": "التي أستخدمها"
    },
    "techstack": {
      "modelingTools": "أدوات النمذجة",
      "uml": "UML",
      "merise": "Merise",
      "technologies": "التقنيات",
      "databaseManagement": "إدارة قواعد البيانات"
    },
    "typewriter": {
      "softwareEngineeringStudent": "طالب هندسة البرمجيات",
      "webDeveloper": "مطور ويب",
      "mernStackDeveloper": "مطور Full-Stack",
      "openSourceContributor": "مطور Saas"
    },
    "resumezouhair": {
      "title": "سيرتي الذاتية",
      "download": "تحميل السيرة الذاتية (PDF)"
    },
    "certificates": {
      "title": "الشهادات",
      "laravelDescription": "تبرز هذه الشهادة تعمقي في إطار عمل Laravel وPHP، مع التركيز على التطبيق العملي لهذه التقنيات في تطوير الويب الحديث. تشمل التعلمات الرئيسية: إتقان دمج PHP في HTML والبرمجة من جانب الخادم، استكشاف ميزات Laravel المتقدمة مثل الوسيط والمصادقة، اكتساب أفضل ممارسات الأمان مع حماية CSRF وأمان الجلسات والتحقق من صحة إدخال المستخدم، وإدارة قواعد البيانات من خلال الترحيلات وEloquent ORM لإدارة المشاريع بفعالية.",
      "softwareEngineeringDescription": "تمثل هذه الشهادة خبرتي في هندسة البرمجيات، مع التركيز على تصميم البرمجيات وإدارة المشاريع. خلال هذه الدورة، اكتسبت مهارات أساسية في هندسة البرمجيات وتفاعل الإنسان مع الحاسوب والبحث والتصميم. بالإضافة إلى ذلك، طورت كفاءات في اختبار البرمجيات وإدارة المشاريع، مما يمكنني من الإشراف على المشاريع بكفاءة وضمان تسليم برمجيات عالية الجودة.",
      "webDevelopmentDescription": "تظهر هذه الشهادة كفاءتي في HTML وCSS وJavaScript لمطوري الويب. في هذه الدورة، طورت أساسًا قويًا في HTML وCSS، وهو أمر ضروري لإنشاء صفحات ويب جذابة بصريًا ومنظمة. بالإضافة إلى ذلك، اكتسبت مهارات عملية في تطوير الويب، مما يمكنني من إنشاء تطبيقات ويب تفاعلية وديناميكية باستخدام JavaScript.",
      "advancedStylingDescription": "تبرز هذه الشهادة في التصميم المتقدم مع التصميم المتجاوب خبرتي في إنشاء تخطيطات قابلة للتكيف. تعلمت استخدام أدوات المتصفح للتصميم المتجاوب، مع التأكيد على أهمية نهج 'الجوال أولاً'. زودتني هذه الدورة بالمهارات اللازمة لكتابة قواعد CSS فعالة لكل من العروض على الأجهزة المحمولة والشاشات الكبيرة، مما يعزز تجربة المستخدم عبر الأجهزة. تشمل المهارات الرئيسية المكتسبة HTML وCSS والتصميم التفاعلي وتطوير الويب والعمليات الاستراتيجية.",
      "promptEngineeringDescription": "تظهر هذه الشهادة في هندسة التوجيه لـ ChatGPT قدرتي على العمل بفعالية مع نماذج اللغة الكبيرة. تعلمت تطبيق تقنيات هندسة التوجيه لتسخير القدرات القوية لنماذج مثل ChatGPT. غطت الدورة استخدام أنماط التوجيه وقدمت رؤى حول إنشاء تطبيقات معقدة قائمة على التوجيه يمكن الاستفادة منها في سياقات مختلفة، بما في ذلك الاستخدام الشخصي والأعمال والتعليم."
    },
    "footer": {
      "designer": "صممه وطوره غوري زهير",
      "copyright": "حقوق النشر © {{year}} ZG"
    },
    "projects": {
      "heading": {
        "recent": "أعمالي",
        "works": "الأخيرة"
      },
      "subheading": "هنا بعض المشاريع التي عملت عليها مؤخرًا.",
      "welcomeImmo": {
        "title": "Welcome Immo",
        "description": "يعيد Welcome Immo تشكيل تجربة العقارات بمنصة حديثة وسهلة الاستخدام. مصممة لكل من المهنيين العقاريين والعملاء الباحثين عن منازل أحلامهم، فهي تبسط إدارة العقارات والتواصل مع العملاء. مع ميزات الإشعارات الذكية وروبوت الدردشة المدعوم بالذكاء الاصطناعي، يجعل Welcome Immo إدارة القوائم والتواصل مع العملاء أمرًا سهلاً، مما يضمن رحلة سلسة وممتعة في عالم العقارات.",
        "technologies": [
          "React.js",
          "Laravel",
          "Pusher للإشعارات في الوقت الفعلي",
          "OpenAI API لوظائف روبوت الدردشة",
          "MySQL لإدارة البيانات القوية"
        ],
        "features": [
          "أدوات فعالة لإدراج وإدارة العقارات",
          "روبوت دردشة مدعوم بالذكاء الاصطناعي لدعم المشرفين بسلاسة",
          "نظام إشعارات في الوقت الفعلي لكل من المشرفين والعملاء",
          "قدرات بحث وتصفية متقدمة للبحث عن العقارات المخصصة"
        ]
      },
      "dreamTravel": {
        "title": "Dream Travel",
        "description": "Dream Travel هو الرفيق الأمثل لمغامراتك! مصمم خصيصًا لاستكشاف مراكش، يجعل هذا التطبيق اكتشاف المعالم السياحية وأماكن الإقامة وخيارات تناول الطعام أمرًا سهلاً. مع اقتراحات السفر المخصصة بناءً على موقعك الحالي وروبوت دردشة ذكي مدعوم بالذكاء الاصطناعي للمساعدة أثناء التنقل، يحول Dream Travel رحلتك إلى تجربة لا تُنسى.",
        "technologies": [
          "Python",
          "Django",
          "Google Maps API",
          "Beautiful Soup لاستخراج البيانات من الويب",
          "TensorFlow لروبوت الدردشة بالذكاء الاصطناعي"
        ],
        "features": [
          "توصيات شخصية في الوقت الفعلي بناءً على الموقع",
          "روبوت دردشة تفاعلي بالذكاء الاصطناعي للإرشاد السياحي الفوري",
          "لوحة تحكم شاملة للمشرفين لإدارة المعلومات السياحية",
          "تكامل سلس مع الخدمات المستندة إلى الموقع لتجارب مخصصة"
        ]
      },
     "chestXRay": {
        "title": "الأشعة السينية للصدر",
        "description": "الأشعة السينية للصدر هو تطبيق مبتكر يستفيد من التعلم الآلي المتقدم لتقييم صور الأشعة السينية للصدر، واكتشاف الالتهاب الرئوي وإنشاء تقارير صحية شاملة. يمكن للمستخدمين أيضًا الوصول إلى روبوت دردشة للحصول على معلومات طبية وأعراض وأدوية.",
        "technologies": [
          "Python",
          "Django",
          "TensorFlow لروبوت الدردشة بالذكاء الاصطناعي",
          "Beautiful Soup لاستخراج البيانات من الويب"
        ],
        "features": [
          "اكتشاف الالتهاب الرئوي من صور الأشعة السينية",
          "إنشاء تقارير صحية شاملة",
          "روبوت دردشة تفاعلي للاستفسارات الطبية",
          "البحث عن الأطباء حسب التخصص والموقع",
          "البيانات مستمدة من استخراج البيانات من الويب للدقة"
        ]
      },
      "rideTogether": {
        "title": "Ride Together",
        "description": "Ride Together هو حلك الأمثل للمشاركة في الركوب بسلاسة! يبسط هذا التطبيق عملية حجز مركبة مع سائقها، مما يجعل السفر أكثر سهولة وراحة للجميع.",
        "technologies": [
          "PHP",
          "MySQL",
          "HTML",
          "CSS",
          "JavaScript"
        ],
        "features": [
          "واجهة سهلة الاستخدام لحجز المركبات",
          "اتصال آمن بين العملاء والسائقين",
          "إدارة فعالة لطلبات الركوب والجداول الزمنية"
        ]
      },
      "disneyDataExploration": {
        "title": "استكشاف بيانات ديزني",
        "description": "انغمس في عالم ديزني الساحر من خلال مشروع التحليل الاستكشافي للبيانات! من خلال تحليل مجموعة بيانات ديزني، يكشف هذا المشروع عن الاتجاهات والعلاقات الخفية في الأفلام والمسلسلات المحبوبة.",
        "technologies": [
          "Python",
          "Pandas",
          "Matplotlib",
          "Seaborn",
          "Jupyter Notebook"
        ],
        "features": [
          "رؤى حول أهم الفئات والمخرجين",
          "تصورات لأداء الممثلين وتصنيفات المسلسلات",
          "تحديد المحتوى المماثل بناءً على ميزات النص",
          "تحليل الاتجاهات حول تركيز محتوى ديزني على مر السنين"
        ]
      }
    },
    "projectCard": {
      "details": "التفاصيل",
      "demo": "عرض توضيحي"
    },
    "detailsModal": {
      "description": "الوصف",
      "technologiesUsed": "التقنيات المستخدمة",
      "keyFeatures": "الميزات الرئيسية",
      "close": "إغلاق",
      "watchDemo": "مشاهدة العرض التوضيحي",
      "collaborators": "المتعاونون"
    },
    "videoModal": {
      "playError": "غير قادر على تشغيل الفيديو.",
      "loadError": "خطأ في تحميل الفيديو.",
      "unsupportedBrowser": "متصفحك لا يدعم علامة الفيديو."
    }
}